sschiesser/SMS_nRF5_remote/sms_remote2/main.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/**
 * @brief Blinky Sample Application main file.
 *
 * This file contains the source code for a sample server application using the LED Button service.
 */

/* ====================================================================
 * PRE-PROCESSING VALUES
 * --------------------------------------------------------------------
 * Includes
 * ==================================================================== */
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"

#include "app_button.h"
#include "bsp.h"
#include "ble_gap.h"
#include "nrf_delay.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_spi.h"
#include "nrf_drv_twi.h"
#include "ble_smss.h"
#include "ble_bas.h"
#include "ble_advertising.h"

#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"

 /*--------------------------------------------------------------------
 * BLE/connection defines
 * -------------------------------------------------------------------- */
#define CENTRAL_LINK_COUNT              0										/**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1										/**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/
#if (NRF_SD_BLE_API_VERSION == 3)
	#define NRF_BLE_MAX_MTU_SIZE		GATT_MTU_SIZE_DEFAULT					/**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif
#define SMS_ADV_INTERVAL                32//160 //64								/**< The advertising interval (in units of 0.625 ms; this value corresponds to 100 ms). */
#define SMS_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED										/**< The advertisement timeout value in seconds */
#define SMS_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2	/**< Reply when unsupported features are requested. */
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(15, UNIT_1_25_MS)			/**< Minimum acceptable connection interval (15 ms). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)			/**< Maximum acceptable connection interval (20 ms). */
#define SLAVE_LATENCY                   50										/**< Slave latency. Range: 0 - 499. Constraint: sup_timeout > 2 x (slave_latency + 1) x conn_interval */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(3000, UNIT_10_MS)			/**< Connection supervisory time-out (3 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000, APP_TIMER_PRESCALER)	/**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)	/**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3										/**< Number of attempts before giving up the connection parameter negotiation. */

 /*--------------------------------------------------------------------
 * Application defines
 * -------------------------------------------------------------------- */
 // General app values
#define SMS_VERSION_ID					0x0201									/**< SMS Version:	MSB --> device ID (01 -> sensors, 02 -> remote, 03 -> central)
																									LSB --> version.subversion (2E -> 2.15) */
#define SMS_RELEASE_ID					001																									
#define SMS_DEVICE_NAME					"SMS_remote"                             /**< Name of device. Will be included in the advertising data. */
#define BOOTLOADER_RESET_3MIN			(0x15C75ABE)							/**<Command to reset device and keep the bootloader active for 3 minutes */
#define BOOTLOADER_DFU_START			(0xB1)
#define DEAD_BEEF                       0xDEADBEEF								/**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE       MAX(APP_TIMER_SCHED_EVT_SIZE, \
                                            BLE_STACK_HANDLER_SCHED_EVT_SIZE)                     /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                10                                                        /**< Maximum number of events in the scheduler queue. */

// LEDs/buttons
#define SMS_CONN_LED_PIN				BSP_BOARD_LED_0							/**< Is on when device is advertising. */
#define SMS_DATA_LED_PIN				BSP_BOARD_LED_1
#define SMS_BUTTON1_PIN					BSP_BUTTON_0							/**< Button that will trigger the notification event with the LED Button Service */
#define SMS_BUTTON2_PIN					BSP_BUTTON_1
#define SMS_BUTTON_DETECTION_DELAY		APP_TIMER_TICKS(5, APP_TIMER_PRESCALER)	/**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */
#define SMS_BUTTON_LONG_PRESS_MS		3000 
#define SMS_LED_BLINK_ULTRA_MS			80
#define SMS_LED_BLINK_FAST_MS			200
#define SMS_LED_BLINK_MEDIUM_MS			1400
#define SMS_LED_BLINK_SLOW_MS			10000
#define SMS_LED_BLINK_CONNECT			10
// Timers
#define APP_TIMER_PRESCALER             0										/**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS            10										/**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE         8										/**< Size of timer operation queues. */
// Batgauge/SAADC
#define SMS_BATGAUGE_SAMPLE_RATE_MS		500										/* Time between each SAADC samples */
#define SMS_BATGAUGE_SAMPLES 			16										/* Number of ADC samples before a batgauge averaging is called */
#define SMS_BATGAUGE_OFFSET				34.1f
#define SMS_BATGAUGE_DIVIDER			114.0f
#define SMS_BATGAUGE_TRIGGER_MIN		0.25
#define	SMS_BATGAUGE_TRIGGER_MS			(SMS_BATGAUGE_TRIGGER_MIN * 60 * 1000)



/* ====================================================================
 * VARIABLES
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
// States
enum sms_running_states {
	SMS_OFF = 0,
	SMS_ADV_START,
	SMS_ADVERTISING,
	SMS_ADV_TIMEOUT,
	SMS_CONNECTING,
	SMS_RUNNING
};
