sschiesser/SMS_nRF5_remote/sms_remote2/main.c
// Hardware interrupts
/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;
	static uint16_t send_value = 0;

    switch (pin_no)
    {
        case SMS_BUTTON1_PIN:
			if(button_action) send_value |= 0xFF;
			else send_value &= 0xFF00;
			NRF_LOG_DEBUG("Bt1 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if((err_code != NRF_SUCCESS) &&							// 0x0000
				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}
			
			if(button_action) m_button_mask |= 0x01;
			else m_button_mask &= 0xF0;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}
			
            break;

		case SMS_BUTTON2_PIN:
			if(button_action) send_value |= 0xFF00;
			else send_value &= 0x00FF;
			NRF_LOG_DEBUG("Bt2 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if((err_code != NRF_SUCCESS) &&							// 0x0000
				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}

			if(button_action) m_button_mask |= 0x10;
			else m_button_mask &= 0x0F;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}

			break;
		
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for handling a finished SAADC conversion.
 *
 * @details	After ADC_SAMPLES_IN_BUFFER ADC sampling, the batgauge handler is called to calculate a
 *			battery level value and set the new value flag.
 *
 * @param[in] p_event	Select which SAADC event has called the handler
 */
void saadc_conversion_done_handler(nrf_drv_saadc_evt_t const * p_event)
{
	NRF_LOG_DEBUG("Batgauge event!!\n\r");
	if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
	{
		ret_code_t err_code;
		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SMS_BATGAUGE_SAMPLES);
		APP_ERROR_CHECK(err_code);
		
		uint8_t i;
		uint32_t sum = 0;
		NRF_LOG_DEBUG("ADC event number: %d\n\r", (int)m_adc_evt_counter);
		for(i = 0; i < SMS_BATGAUGE_SAMPLES; i++)
		{
			m_buffer_pool[i] = p_event->data.done.p_buffer[i];
			NRF_LOG_DEBUG("%d\r\n", m_buffer_pool[i]);
			sum += m_buffer_pool[i];
		}
		uint16_t adc = (uint16_t)((float)sum / (float)SMS_BATGAUGE_SAMPLES);
		uint16_t mvolts = (uint16_t)( (((float)adc + SMS_BATGAUGE_OFFSET) / SMS_BATGAUGE_DIVIDER) * 1000 );
		uint8_t level = battery_level_in_percent(mvolts);
		m_app_state.batgauge.bat_level = (uint32_t)level;
		NRF_LOG_DEBUG("Batgauge avg: %d (sum: %d)\n\r", m_app_state.batgauge.bat_level, sum);
		m_adc_evt_counter++;
		m_app_state.batgauge.new_value = true;
		
		app_timer_stop(saadc_timer_id);
		nrf_drv_saadc_uninit();
		nrf_drv_saadc_uninit();
		NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear << SAADC_INTENCLR_END_Pos);
		NVIC_ClearPendingIRQ(SAADC_IRQn);
		app_timer_start(batgauge_timer_id,
			APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BATGAUGE_TRIGGER_MS, UNIT_1_00_MS), 0),
			NULL);
		m_app_state.batgauge.init_ok = false;
		m_app_state.batgauge.enabled = false;
	}
}

/**@brief Function for handling the saadc timer.
 *
 * @details	Start a new SAADC sampling sequence.
 *
 * @param[in] p_context	unused
 */
static void saadc_timer_handler(void * p_context)
{
	NRF_LOG_DEBUG("saadc timer done\n\r");
	nrf_drv_saadc_sample();
}



static void batgauge_event_handler(void)
{
	NRF_LOG_DEBUG("Retriggering batgauge\n\r");
	batgauge_init();
}

// BLE
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
        case BLE_ADV_EVT_IDLE:
        default:
            break;
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling the Application's BLE stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
			NRF_LOG_DEBUG("Connected\r\n");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
			m_app_state.sms = SMS_CONNECTING;
            break; // BLE_GAP_EVT_CONNECTED

        case BLE_GAP_EVT_DISCONNECTED:
			NRF_LOG_DEBUG("Disconnected\r\n");
			sensors_stop();
			if(m_app_state.sms == SMS_RUNNING) {
				m_app_state.sms = SMS_ADV_START;
			}
            break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST
		
