sschiesser/SMS_nRF5_remote/sms_remote2/main.c
		case BLE_GAP_EVT_TIMEOUT:
			NRF_LOG_DEBUG("GAP Event Timeout.\r\n");
			m_app_state.led[0] = LED_GAP_TIMEOUT;
			sms_switch_off(false);
			break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
			NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
			NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = SMS_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        default:
            // No implementation needed.
            break;
    }
}
/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_smss_on_ble_evt(&m_smss_service, p_ble_evt);
	ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
}
/* ====================================================================
 * INITIALIZATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
// Board
/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_leds_init();
}


/**@brief Function to initialize the battery gauge.
 *
 * @details Configure the SAADC channel and the sample buffer. But DON'T START!
 */
void batgauge_init(void)
{
	NRF_LOG_DEBUG("Preparing AIN0 as battery level input\r\n");
	ret_code_t err_code;
	err_code = nrf_drv_saadc_init(NULL, saadc_conversion_done_handler);
	APP_ERROR_CHECK(err_code);

	nrf_saadc_channel_config_t channel_config =
		NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
	channel_config.gain = NRF_SAADC_GAIN1;
	channel_config.acq_time = NRF_SAADC_ACQTIME_40US;
	err_code = nrf_drv_saadc_channel_init(0, &channel_config);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool, SMS_BATGAUGE_SAMPLES);
	APP_ERROR_CHECK(err_code);
	
//	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SMS_BATGAUGE_SAMPLES);
//	APP_ERROR_CHECK(err_code);
	
	m_app_state.batgauge.init_ok = true;
	m_app_state.batgauge.enabled = true;
	m_app_state.batgauge.start = true;
}




/**@brief Function for initialising the button handler module.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {SMS_BUTTON1_PIN, false, BUTTON_PULL, button_event_handler},
		{SMS_BUTTON2_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               SMS_BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


// Drivers
/**@brief Function for the Timer initialization.
 *
 * @details Create the timer modules. BUT DON'T START!
 */
static void timers_init(void)
{
	uint32_t err_code;

    // Initialize application timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	
	// Create timers...
	// - button long pressing timer
	err_code = app_timer_create(&button_press_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								(app_timer_timeout_handler_t)button_press_timeout_handler);
	APP_ERROR_CHECK(err_code);
	
	// - SAADC polling
	err_code = app_timer_create(&saadc_timer_id,
								APP_TIMER_MODE_REPEATED,
								(app_timer_timeout_handler_t)saadc_timer_handler);
	APP_ERROR_CHECK(err_code);
	
	// - LEDs blinking timers
	err_code = app_timer_create(&led0_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								(app_timer_timeout_handler_t)led0_timer_handler);
	APP_ERROR_CHECK(err_code);
	err_code = app_timer_create(&led1_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								(app_timer_timeout_handler_t)led1_timer_handler);
	APP_ERROR_CHECK(err_code);
	
	// - batgauge timer
	err_code = app_timer_create(&batgauge_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								(app_timer_timeout_handler_t)batgauge_event_handler);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting the bootloader for 3 minutes
 *
 * @details	Set the new value in GPREGRET, disable sd and reset
 *
 * @param[in] conn_handle	The current BLE connection handle needed to disconnect.
 */
static void bootloader_start(uint16_t conn_handle)
{
	uint32_t err_code;
	
	/* Force disconnect, disable softdevice, and then reset */
	sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	// The below requires at least bootloader 3.1
//	err_code = sd_power_gpregret_set(BOOTLOADER_DFU_START, 0x000000FF);
	err_code = sd_power_gpregret_set(0, BOOTLOADER_DFU_START);
	APP_ERROR_CHECK(err_code);
	
	sd_softdevice_disable();
	
