sschiesser/SMS_nRF5_remote/sms_remote2/main.c
	nrf_delay_us(500 * 1000);
	
	//reset system to start the bootloader
	NVIC_SystemReset();
}

	


// BLE
/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)SMS_DEVICE_NAME,
                                          strlen(SMS_DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = SMS_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = SMS_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the reception of a write command.
 *
 * @details	Concatenate the received data into a 32bit value and check
 * 			check for the corresponding command.
 *
 * @param[in] p_smss	SMS service struct containing the connection handle
 * @param[in] data		Pointer to the command data
 */
static void app_write_function(ble_smss_t * p_smss, uint8_t *data)
{
	uint32_t command =	(data[0] + (data[1] << 8) +
						(data[2] << 16) + (data[3] << 24));
	NRF_LOG_DEBUG("Received app update command: %#x\n\r", command);
	if(command == 0x1c57b007) {
		NRF_LOG_DEBUG("Restarting device with 3 min bootloader...\n\r");
		bootloader_start(p_smss->conn_handle);
//		NRF_LOG_DEBUG("Closed loop latency test\n\r");
//		ble_smss_on_button_change(&m_smss_service, 0x1234);
	}
//	else if(command == 0x11223344)
//	{
//		NRF_LOG_DEBUG("Closed loop latency test\n\r");
//		ble_smss_on_button_change(&m_smss_service, 0x1234);
//	}
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	uint32_t err_code;
	
	ble_smss_init_t init;
	init.app_write_function = app_write_function;
	ble_smss_init(&m_smss_service, &init);
	 
    ble_bas_init_t bas_init;

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

	// Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t             err_code;

	NRF_LOG_INFO("Starting advertising for %d seconds\n\r", SMS_ADV_TIMEOUT_IN_SECONDS);

	m_app_state.sms = SMS_ADVERTISING;
	m_app_state.led[0] = LED_ON;
	bsp_board_led_on(SMS_CONN_LED_PIN);
	err_code = app_timer_start(led0_timer_id, 
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_FAST_MS, UNIT_1_00_MS), 0),
					NULL);
	
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
}


/* ====================================================================
 * RUN-TIME FUNCTIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Stop all sensors.
 *
 * @details	1. switch off the power supplies (pressure, imu)
 *			2. stop the polling timer (pressure, imu, batgauge)
 *			3. clear the enabled flag for all sensors
 */
void sensors_stop(void)
{
	app_timer_stop(saadc_timer_id);
	nrf_drv_saadc_uninit();
	nrf_drv_saadc_uninit();
	NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear << SAADC_INTENCLR_END_Pos);
	NVIC_ClearPendingIRQ(SAADC_IRQn);
	app_timer_stop(batgauge_timer_id);
	m_app_state.batgauge.init_ok = false;
	m_app_state.batgauge.enabled = false;
}

/**@brief Start the button push timer in order to detect a long push.
 */
void button_press_timer_start(void)
{
	app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);
}



/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Setup log
	err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);
	uint8_t fw_msb, fw_lsb;
	fw_msb = ((SMS_VERSION_ID & 0xFF) > 8);
	fw_lsb = (SMS_VERSION_ID & 0x0F);
	NRF_LOG_INFO("===============================\n\r");
	NRF_LOG_INFO("SMS sensors firmware v%d.%d, r%03d\n\r", fw_msb, fw_lsb, SMS_RELEASE_ID);
	NRF_LOG_INFO("===============================\n\n\r");

	// Initialize hardware & services
    timers_init();
    leds_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

	// Initialize & configure peripherals
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
		
	// Start advertising
	m_app_state.sms = SMS_ADV_START;
	
    // Enter main loop.
    for (;;)
    {
		switch(m_app_state.sms)
		{
			case SMS_ADV_START:
				NRF_LOG_DEBUG("Starting advertising for 30 seconds\n\r");
				bsp_board_led_off(SMS_DATA_LED_PIN);
				app_timer_stop(led1_timer_id);
				advertising_start();
				break;
			
			case SMS_CONNECTING:
				NRF_LOG_DEBUG("Stopping timer\n\r");
				app_timer_stop(led0_timer_id);
				m_app_state.sms = SMS_RUNNING;
				m_led_blink_cnt = 0;
				bsp_board_led_invert(SMS_CONN_LED_PIN);
				NRF_LOG_DEBUG("Starting timer\n\r");
				app_timer_start(led0_timer_id,
						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_ULTRA_MS, UNIT_1_00_MS), 0),
						NULL);
//				batgauge_init();
				break;
			
			default:
				break;
		}
		
		// Start flag of the battery gauge (SAADC)
		if(m_app_state.batgauge.start)
		{
			NRF_LOG_DEBUG("Starting battery level measurement\n\r");
			nrf_drv_saadc_sample();
			app_timer_start(saadc_timer_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BATGAUGE_SAMPLE_RATE_MS, UNIT_1_00_MS), 0),
							NULL);
			m_app_state.batgauge.enabled = true;
			m_app_state.batgauge.start = false;
		}

		// New value flag of the battery gauge... sends notification automatically
		if(m_app_state.batgauge.new_value)
		{
			m_app_state.batgauge.new_value = false;
			uint32_t err_code;
			err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)m_app_state.batgauge.bat_level);
			if((err_code != NRF_SUCCESS) &&							// 0x0000
				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
			{
				APP_ERROR_HANDLER(err_code);
			}
		}

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
	}
}


/**
 * @}
 */
